In [1]:
import pandas as pd
from sqlalchemy import create_engine

In [2]:
df = pd.read_csv('weight-height-updated.csv')
df.head()

  Gender     Height      Weight  Born_Year
0   Male  73.847017  241.893563     1967.0
1   Male  68.781904  162.310473     1977.0
2   Male  74.110105  212.740856     1991.0
3   Male  71.730978  220.042470     1998.0
4   Male  69.881796  206.349801     1985.0

In [ ]:
from sqlalchemy import create_engine
engine = create_engine("engine = create_engine("postgresql://username:password@host:port/dbname")

In [4]:
df.to_sql('Weight',engine,if_exists='replace',index=False,schema='development')

1000

In [10]:
query = 'SELECT * FROM development."Weight"'

In [11]:
df_1 = pd.read_sql(query, engine)

In [12]:
df_1.head()

  Gender     Height      Weight  Born_Year
0   Male  73.847017  241.893563     1967.0
1   Male  68.781904  162.310473     1977.0
2   Male  74.110105  212.740856     1991.0
3   Male  71.730978  220.042470     1998.0
4   Male  69.881796  206.349801     1985.0

In [13]:
df_1.tail()

      Gender     Height      Weight  Born_Year
9995  Female  66.172652  136.777454     2003.0
9996  Female  67.067155  170.867906        NaN
9997  Female  63.867992  128.475319     2002.0
9998  Female  69.034243  163.852461     1983.0
9999  Female  61.944246  113.649103     1986.0

In [14]:
df_1.isnull().sum() #checks for total number of nulls

Gender          0
Height          0
Weight          0
Born_Year    1000
dtype: int64

In [15]:
df_1.shape #checks number of rows and columns

(10000, 4)

In [16]:
df_1.dtypes

Gender        object
Height       float64
Weight       float64
Born_Year    float64
dtype: object

In [17]:
df_1.describe()

             Height        Weight    Born_Year
count  10000.000000  10000.000000  9000.000000
mean      66.367560    161.440357  1985.366556
std        3.847528     32.108439    11.441963
min       54.263133     64.700127  1966.000000
25%       63.505620    135.818051  1976.000000
50%       66.318070    161.212928  1985.000000
75%       69.174262    187.169525  1995.000000
max       78.998742    269.989699  2005.000000

In [18]:
cv = (32.11/161.44)*100 #Checks the percentage of coefficient of variance, determines whether to use mode or mean
cv

19.889742319127848

In [19]:
c_v1 = (11.44/1985.36)*100 #cv<10%, therefore can use mean to fill nulls
c_v1

0.5762179151388162

In [20]:
c_v = (3.85/66.37)*100 # finding cv of height, low cv, can use mean<10%
c_v

5.800813620611722

In [21]:
df_1['Born_Year'] = df_1['Born_Year'].fillna(df_1['Born_Year'].mode()[0])

In [22]:
df_1.isnull().sum()

Gender       0
Height       0
Weight       0
Born_Year    0
dtype: int64

In [23]:
#Drop
#df_1.dropna() #drops rows with missing values
#df_1.dropna(axis=1) #drops columns with missing values

In [24]:
df_1['Born_Year'] = df_1['Born_Year'].astype(int)
df_1.dtypes

Gender        object
Height       float64
Weight       float64
Born_Year      int64
dtype: object

In [25]:
df_1.head()

  Gender     Height      Weight  Born_Year
0   Male  73.847017  241.893563       1967
1   Male  68.781904  162.310473       1977
2   Male  74.110105  212.740856       1991
3   Male  71.730978  220.042470       1998
4   Male  69.881796  206.349801       1985

(weight in pounds / height in inches²) * 703.

In [26]:
df_1['bmi'] =  (df_1['Weight'] / (df_1['Height'])**2) * 703. 
df_1.head()

  Gender     Height      Weight  Born_Year        bmi
0   Male  73.847017  241.893563       1967  31.182700
1   Male  68.781904  162.310473       1977  24.118677
2   Male  74.110105  212.740856       1991  27.230233
3   Male  71.730978  220.042470       1998  30.064108
4   Male  69.881796  206.349801       1985  29.705117

In [28]:
import datetime
df_1['current_year'] = datetime.datetime.now().year

In [29]:
df_1.head()

  Gender     Height      Weight  Born_Year        bmi  current_year
0   Male  73.847017  241.893563       1967  31.182700          2025
1   Male  68.781904  162.310473       1977  24.118677          2025
2   Male  74.110105  212.740856       1991  27.230233          2025
3   Male  71.730978  220.042470       1998  30.064108          2025
4   Male  69.881796  206.349801       1985  29.705117          2025

In [30]:
df_1['age'] = (df_1['current_year'] - df_1['Born_Year'])

In [31]:
df_1.head()

  Gender     Height      Weight  Born_Year        bmi  current_year  age
0   Male  73.847017  241.893563       1967  31.182700          2025   58
1   Male  68.781904  162.310473       1977  24.118677          2025   48
2   Male  74.110105  212.740856       1991  27.230233          2025   34
3   Male  71.730978  220.042470       1998  30.064108          2025   27
4   Male  69.881796  206.349801       1985  29.705117          2025   40

Underweight | < 18.5

Normal weight | 18.5 - 24.9

Overweight | 25.0 - 29.9

Obesity Class I | 30.0 - 34.9

Obesity Class II | 35.0 - 39.9

Obesity Class III | ≥ 40.0

In [32]:
def bmi_category(bmi):
    if bmi< 18.5:
        return "Underweight"
    elif bmi <= 24.9:
        return "Normal Weight"
    elif bmi <= 29.9:
        return "Overweight"
    elif bmi <= 34.9:
        return "Obesity Class I"
    elif bmi <= 39.9:
        return "Obesity Class II"
    else:
        return "Obesity Class III"

In [33]:
bmi_category(18.5)

'Normal Weight'

In [34]:
df_1['bmi_category'] = df_1['bmi'].apply(bmi_category)

In [35]:
df_1.head()

,Gender,Height,Weight,Born_Year,bmi,current_year,age,bmi_category
0,Male,73.847017,241.893563,1967,31.182700,2025,58,Obesity Class I
1,Male,68.781904,162.310473,1977,24.118677,2025,48,Normal Weight
2,Male,74.110105,212.740856,1991,27.230233,2025,34,Overweight
3,Male,71.730978,220.042470,1998,30.064108,2025,27,Obesity Class I
4,Male,69.881796,206.349801,1985,29.705117,2025,40,Overweight

In [36]:
df_1.to_sql('Weight', engine, if_exists='replace', index=False, schema='development')

1000